#ifndef __I2C_H__
#define __I2C_H__


/******************************************************************************/
/*      AT24C02_硬件连接                                                       */
/******************************************************************************/
#define IIC_SCL     P0^0        //串行时钟
#define IIC_SDA     P0^1        //串行数据
/******************************************************************************/
/*      AT24C02_函数声明                                                       */
/******************************************************************************/
void iic_start_signal(void);    //主机发送起始信号
void iic_stop_signal(void);     //主机发送停止信号
uint8_t iic_write(uint8_t dat); //主机向总线写入1个字节数据
uint8_t iic_read(void);         //读取从机发来的1个字节数据
void host_send_ack(void);       //主机发送应答信号
void host_send_nack(void);      //主机发送非应答信号（NACK）
uint8_t slave_send_ack(void);   //从机发送应答信号


#endif
