/*******************************************************************************
  函数名称: nvic_setup()
  输入参数: 无
  输出参数: 无
  函数功能: 设置中断优先级分组和设置相应的中断优先级
*******************************************************************************/
void nvic_setup(void)
{
        //清除高16位和(清除 bit_10, bit_9, bit_8位) 
        SCB->AIRCR &= uint32_t(0x0000F8FF);
        //写入访问钥匙，并设置优先级分组(4位抢占优先级, 0位响应优先级)
        SCB->AIRCR |= uint32_t(0x05FA0000 | 0x00000300);
        //设置SysTick的优先级为15，它属于系统异常，所以它的优先级在SCB->SHP里设置
        SCB->SHP[11]=0xF0;
}
