#ifndef __LED_SMG__
#define __LED_SMG__

/************************************************************/
/* % __IO__共阴极数码管__IO__ */ 
/************************************************************/
#define SMG_SEG P0  /* % P0_数码管段码 */
#define SMG_BIT P2  /* % P2_数码管位选 */
#define SMG_N   4   /* % 数码管个数 */

/* % 数据显示缓冲区 */   
uint8_t led_buf[22, 22, 22, 22];


/************************************************************/
/* % 共阴极数码管, 段码信号定义 */
/************************************************************/
uint8_t code smg_seg_code[] = { 
    0x3F,   /* % “0” */
    0x06,   /* % “1” */
    0x5B,   /* % “2” */
    0x4F,   /* % “3” */
    0x66,   /* % “4” */
    0x6D,   /* % “5” */
    0x7D,   /* % “6” */
    0x07,   /* % “7” */
    0x7F,   /* % “8” */
    0x6F,   /* % “9” */
    0x77,   /* % “A” */
    0x7C,   /* % “B” */
    0x39,   /* % “C” */
    0x5E,   /* % “D” */
    0x79,   /* % “E” */
    0x71,   /* % “F” */
    0x76,   /* % “H” */
    0x38,   /* % “L” */
    0x37,   /* % “n” */
    0x3E,   /* % “u” */
    0x73,   /* % “p” */
    0x5C,   /* % “o” */
    0x40,   /* % “-” */
    0x00    /* % “关闭数码管” */
};
/************************************************************/
/* % 共阴数码管, 位选信号定义 */ 
/************************************************************/
uint8_t code smg_bit_code[] = {
    0xfe,   /* % 第“0”位数码管 */ 
    0xfd,   /* % 第“1”位数码管 */  
    0xfb,   /* % 第“2”位数码管 */  
    0xf7,   /* % 第“3”位数码管 */  
    0xef,   /* % 第“4”位数码管 */  
    0xdf,   /* % 第“5”位数码管 */  
    0xbf,   /* % 第“6”位数码管 */  
    0x7f    /* % 第“7”位数码管 */ 
};


#if WINDOW
/************************************************************/
/* % 数码管动态扫描, 窗口定义 */
/************************************************************/
uint8_t window;         /* % 定义一个窗口变量 */
uint8_t parm1 = 44;     /* % 定义第一个窗口参数变量 */
uint8_t parm2 = 55;     /* % 定义第二个窗口参数变量 */
uint8_t parm3 = 66;     /* % 定义第三个窗口参数变量 */
uint8_t parm4 = 77;     /* % 定义第四个窗口参数变量 */
#endif


#if DIGDOT
/************************************************************/
/* % 8位共阴极数码管, 小数点位显示 */   
/************************************************************/
uint8_t digdot0 = 0;    /* % 第“1”个数码管小数点 */
uint8_t digdot1 = 0;    /* % 第“2”个数码管小数点 */
uint8_t digdot2 = 0;    /* % 第“3”个数码管小数点 */
uint8_t digdot3 = 0;    /* % 第“4”个数码管小数点 */
uint8_t digdot4 = 0;    /* % 第“5”个数码管小数点 */
uint8_t digdot5 = 0;    /* % 第“6”个数码管小数点 */
uint8_t digdot6 = 0;    /* % 第“7”个数码管小数点 */
uint8_t digdot7 = 0;    /* % 第“8”个数码管小数点 */
#endif

#endif


