/**
  *****************************************************************************
  *
  IO端口模拟 SPI总线
  1. CPOL,代表空闲状态; 0代表低电平, 1代表高电平
  2. CPHA,代表采样时机; "0"第一个边沿采样，第二个边沿输出, "1"第2个边沿采样，第1个边沿输出
  
  时钟相位和极性选择
  CPOL,时钟极性         CPHA，时钟相位           工作模式
  0                     0                       mode_0
  0                     1                       mode_1
  1                     0                       mode_2
  1                     1                       mode_3
  
  SPI管脚定义
  MOSI,主机输出从机输出		
  MISO,主机输入从机输出	
  CLK, 同步时钟信号 		
  NSS, 片选信号
  *
  *   
  写操作：在输出数据之前，一定要把数据准备好
  读操作：在边沿后面读取数据
  *****************************************************************************
  * 2018.10.30
  * @freeysh
  */
  
  
  
#define u8 unsigned char

#define MOSI
#define MISO
#define CLK
#define NSS
  
/* SPI工作模式0，写一个字节函数，从高位开始传数据 */  
void analog_spi_write_byte(u8 data)
{
    u8 i;
    CLK = 0;                            //时钟空闲状态 ===================
    for (i = 0; i < 8; i++) {           //1个byte,经过8次移位，完全输出数据
        CLK = 1;                        //已经产生了第一个边沿
        MOSI = ((data<<i) & 0x80)>>8;	//准备好数据，因为接下来要输出
        CLK = 0;                        //第二个边沿，输出数据
    }
    CLK = 0;                            //时钟空闲状态 ===================
}  
/* SPI工作模式0，读一个字节函数，从高位开始传数据 */  
void analog_spi_read_byte(void)
{
    u8 i;
    u8 j = 0;
    u8 data = 0;
    CLK = 0;                            //时钟空闲状态 ===================
    for (i = 0; i < 8; i++) {           //1个byte,经过8次移位，完全输入数据
        CLK = 1;                        //已经产生了第一个边沿,这时已经拿到数据
        j = MISO;                       //提取 MISO这一位
        data |= j;
        data = data<<1;
        CLK = 0;			
    }
    CLK = 0;                            //时钟空闲状态 ===================
    return(data);
}   
  
/*
SPI mode1
write()
{
        clk = 0;
        for (i = 0; i <8; i++) {
                mosi = data; //准备数据
                clk = 1;     //第1个边沿输出数据
                clk = 0;
        }
}
 */
  
  
