#ifndef __GPIO_H__
#define __GPIO_H__

#include "common.h"
void gpio_setup(void);



// STM32F10x_GPIO 管脚配置
//___________________________________________________________//
//      GPIOx_CRL    -> 0  1  2   3   4   5   6   7          //  0~7 管脚
//      GPIOx_CRH    -> 8  9  10  11  12  13  14  15         // 8~16 管脚
//___________________________________________________________//
//      ||      0 0 0 0     |  0  | 模拟输入
//      ||      0 1 0 0     |  4  | 浮空输入(复位后的状态) 
//      ||      1 0 0 0     |  8  | 下拉输入(如果 PxODR = 0)
//      ||      1 0 0 0     |  8  | 上拉输入(如果 PxODR = 1)
//      ||      1 1 0 0     |  C  | 保留

//      ||      0 0 0 1     |  1  | 推挽输出(10MHz)
//      ||      0 0 1 0     |  2  | 推挽输出(02MHz)
//      ||      0 0 1 1     |  3  | 推挽输出(50MHz)
//              
//      ||      0 1 0 1     |  5  | 开漏输出(10MHz)
//      ||      0 1 1 0     |  6  | 开漏输出(02MHz)
//      ||      0 1 1 1     |  7  | 开漏输出(02MHz)
              
//      ||      1 0 0 1     |  9  | 复用推挽输出(10MHz)
//      ||      1 0 1 0     |  A  | 复用推挽输出(02MHz)
//      ||      1 0 1 1     |  B  | 复用推挽输出(50MHz)
       
//      ||      1 1 0 1     |  D  | 复用开漏输出(10MHz)
//      ||      1 1 1 0     |  E  | 复用开漏输出(02MHz)
//      ||      1 1 1 1     |  F  | 复用开漏输出(50MHz)
//___________________________________________________________//




#endif
