#include <stdio.h>
#include <stdlib.h>
#include <string.h>
/*******************************************************************************
int (*p)[4];            数组指针（是一个指向数组的一个指针）
int *p[10];             指针数组（是一个存放指针的数组）
int (*fun_ptr)(int);    函数指针（是一个存放函数地址的指针 ）
int (*arr[10])(int);    函数指针数组（把函数的地址存到一个数组中，那这个数组就叫函数指针数组）
int (*fun())[10];       （返回数组指针）的函数

//指向函数指针数组的指针
int (*arr[5])(int ,int) = {NULL,Add,Sub,Mul,Div};
int (*(*p)[5])(int ,int) = &arr;
=> 指向函数指针数组的指针是一个（指针） ，指针指向一个（数组）， 数组的元素都是（函数指针）
*******************************************************************************/



/*******************************************************************************
        => fun_ptr__函数指针__
*******************************************************************************/
#define fun_ptr_00_macro        1
#if fun_ptr_00_macro


int add(int a, int b)
{
        return (a+b);
}

void fun_ptr_00(void)
{
        int (*fun_ptr)(int, int);
        fun_ptr = add;
        printf("函数指针: %d\n", fun_ptr(9, 9));
        printf("函数指针: %d\n", (*fun_ptr)(9, 9));
        printf("函数指针: %d\n", (*add)(9, 9));
        printf("函数指针的地址为: %p\n", *fun_ptr);
        printf("函数的地址为: %p\n", add);
        printf("函数的地址为: %p\n", *add);
        printf("函数指针: %d\n", (*add)(3, 3));
}
#endif



/*******************************************************************************
        => main
*******************************************************************************/
int main(void)
{
        fun_ptr_00();
        printf("A+B =  %d\n", add(33, 33));
        printf("A+B =  %d\n", (*add)(13, 13));
}
