/*******************************************************************************
  函数名称: usart1_setup()
  输入参数: 无
  输出参数: 无
  函数功能: USART1初始化设置 72MHz@115200 1N8
*******************************************************************************/
void usart1_setup(void)
{   
        GPIOA_CLOCK_ENABLE();                   //打开GPIOA时钟
        USART1_CLOCK_ENABLE();                  //打开USART1时钟
	GPIOA->CRH  &= (uint32_t)(0xFFFFF00F);  //
	GPIOA->CRH  |= (uint32_t)(0x000000B0);  //TX(PA.09)复用推挽输出(50MHz)
	GPIOA->CRH  |= (uint32_t)(0x00000400);  //RX(PA.10)浮空输入
	USART1->CR1 |= BIT_13;                  //USART模块使能
	USART1->CR1 &= ~BIT_12;                 //1个起始位, 8个数据位
	USART1->CR2 &= ~(BIT_13 + BIT_12);      //1个停止位(bit13=0, bit12=0)
	USART1->CR1 |= BIT_03 + BIT_02;         //发送使能 | 接收使能 
	USART1->BRR  = 0x0271;                  //72MHz@115200 			
}
/*******************************************************************************
  函数名称: main()
  输入参数: 无
  输出参数: 无
  函数功能: 以'A'为起始， 发送发送30个字符到USART的DR寄存器
*******************************************************************************/
int main(void)
{
        int i, data,;
        data = 'A';
        for (i = 0; i < 30; i++) {
	        USART1->DR = data;
	        data++;
	        //等待数据发送完成标志置“1”
	        while ((USART1->SR & (1 << 6) == 0);
        }
        return 0;
}
