#if BSP
//_____________________________________________________________
void    类型是（基础类型）， 对应的指针类型为（void *）
void *  是指针类型， 其指针变量能够保存地址
        通过（void *）指针无法获取内存中的数据（无长度信息）
        1 不可使用 void * 指针直接取内存数据
        2 void * 指针可与其它数据指针相互赋值
//_____________________________________________________________
int    i = 1;
float  f = 2.0f;
double d = 3.0;
void * ptr = NULL;
ptr = &i;       //正确的赋值
ptr = &f;       //正确的赋值
ptr = &d;       //正确的赋值
double pdf * = NULL;


//（void *）类型，可以保存任意类型的指针
printf("%p\n", ptr);


//错误的解引用， 因为（void *）类型的指针没有长度信息
//（void *）类型无法访问内存中的数据
printf("%f\n", *ptr);


//（void *）类型，可以直接合法的赋值给其它具体数据类型的指针变量
pdf = ptr;
#endif



/*******************************************************************************
        => MALLOC
*******************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
        int *ptr = malloc(4 * sizeof(int));
        int i = 0;
        
        if (ptr != NULL) {
                for (i = 0; i < 4; i++) {
                        ptr[i] = i * 10;
                }
                for (i = 0; i < 4; i++) {
                        printf("%d\n", ptr[i]);
                }
                free(ptr);
        }
        return (0);
}



/*******************************************************************************
        => POINTER
*******************************************************************************/
int main(void)
{
        int a = 0;
        int b = 0;
        
        int  *p  = &a;
        int **pp = &p;
        
        **p = 2;        // a = 2
        
        *PP = &b;       // p = &b;
        
        *p  = 3;        // b = 3;
        
        printf("a = %d, b = %d\n", a, b);
}

/*******************************************************************************
        => POINTER
*******************************************************************************/
int getDouble(double **pp, unsigned n) 
{
        int ret = 0;
        double *pd = malloc(sizeof(double) * n);
        if (pd != NULL) {
                printf("pd = %p\n", pd);
                *pp = pd;
                ret = 1;
        }
        return (ret);
}

int main(void) 
{
        double *ptr = NULL;
        if (getDouble(&ptr, 5)) {
                printf("ptr = %p\n", ptr);
                free(ptr);
        }
        return (0);
}

/*******************************************************************************
        => ARRAY
*******************************************************************************/
// 一维数组名的类型为（Type *）
// 二维数组名的类型为（Type (*)[]）
// C语言没有多维数组（只有一维数组）

int main(void)
{
        int a[] = {1, 2, 3, 4};
        int *pa = a;
        printf("a = %p. pa = %p\n", a, pa);
        
        //b的数据类型为（int (*)[]）
        int b[2][2] = {{1, 2}, {3, 4}};
        int (*pb)[2] = b;
        printf("b = %p. pb = %p\n", b, pb);
        
        return (0);
}

/*******************************************************************************
        => ARRAY
*******************************************************************************/
int main(void)
{
       int b[][2] = {1, 2, 3, 4};
       int (*pb)[2] = b;
       
       //pb[0] => {1, 2}
       //pb[1] => {3, 4}
       // b[1][0] = 30;
       *pb[1] = 30;
       
       printf("b[0][0] = %d\n", b[0][0] );
       printf("b[0][1] = %d\n", b[0][1] );
       printf("b[1][0] = %d\n", b[1][0] );
       printf("b[1][1] = %d\n", b[1][1] );
       
       return (0);
}
