/******************************************************************************/
//存储器到存储器DMA传输（FLASH => SRAM）
//      => 定义(src_const_buff[]数组作DMA传输的数据源)
//      => const关键字，就是将src_const_buff[]数组变量类型 ->定义为常量类型
//      => const src_const_buff[]表示数据存储在FLASH中
/******************************************************************************/
#define BUFFER_SIZE             12

//下面的数据存储在内部FLASH中
//_________________________________________________________
const uint32_t src_const_buf[BUFFER_SIZE] = {
        0x01020304, 0x06060708, 0x090A0B0C, 0x0D0E0E10,
        0x11020304, 0x16060708, 0x190A0B0C, 0x1D0E0E10,
        0x21020304, 0x26060708, 0x290A0B0C, 0x2D0E0E10
};

//下面的数据存储在内部SRAM中
//_________________________________________________________
uint32_t destination_buf[BUFFER_SIZE];



/*******************************************************************************
  函数名称: dma_setup()
  输入参数: 无
  输出参数: 无
  函数功能: 存储器到存储器DMA数据传输（FLASH => SRAM）
*******************************************************************************/
void dma_setup(void)
{
        DMA_
}
